WcfServicesApp/WcfServicesApp.ClientApp/XML/EnvelopeBody.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <GUI_DON_HANG xmlns="http://tempuri.org/GUI_DON_HANG">
            <ds>
                <xs:schema id="NewDataSet" xmlns="" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata">
                    <xs:element name="NewDataSet" msdata:IsDataSet="true" msdata:UseCurrentLocale="true">
                        <xs:complexType>
                            <xs:choice minOccurs="0" maxOccurs="unbounded">
                                <xs:element name="Table1">
                                    <xs:complexType>
                                        <xs:sequence>
                                            <xs:element name="ORDER_NO" type="xs:string" minOccurs="0" />
                                            <xs:element name="STATUS" type="xs:string" minOccurs="0" />
                                            <xs:element name="ORDER_DAT" type="xs:string" minOccurs="0" />
                                            <xs:element name="ORDER_TIM" type="xs:string" minOccurs="0" />
                                            <xs:element name="ORDER_OPTR" type="xs:string" minOccurs="0" />
                                            <xs:element name="EXP_RCV_DAT" type="xs:string" minOccurs="0" />
                                            <xs:element name="WH_CODE" type="xs:string" minOccurs="0" />
                                            <xs:element name="TYPE_CODE" type="xs:string" minOccurs="0" />
                                            <xs:element name="BP_CODE" type="xs:string" minOccurs="0" />
                                            <xs:element name="TOTAL" type="xs:string" minOccurs="0" />
                                            <xs:element name="APV_DAT" type="xs:string" minOccurs="0" />
                                            <xs:element name="APV_TIM" type="xs:string" minOccurs="0" />
                                            <xs:element name="APV_OPTR" type="xs:string" minOccurs="0" />
                                            <xs:element name="DCS_DAT" type="xs:string" minOccurs="0" />
                                            <xs:element name="DCS_TIM" type="xs:string" minOccurs="0" />
                                            <xs:element name="DCS_OPTR" type="xs:string" minOccurs="0" />
                                            <xs:element name="RMRK1" type="xs:string" minOccurs="0" />
                                            <xs:element name="RMRK2" type="xs:string" minOccurs="0" />
                                            <xs:element name="REASON" type="xs:string" minOccurs="0" />
                                            <xs:element name="ACTFLG" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDUSR" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDWKS" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDPGM" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDDTM" type="xs:string" minOccurs="0" />
                                            <xs:element name="MDFUSR" type="xs:string" minOccurs="0" />
                                            <xs:element name="MDFWKS" type="xs:string" minOccurs="0" />
                                            <xs:element name="MDFPGM" type="xs:string" minOccurs="0" />
                                            <xs:element name="LSTMDF" type="xs:string" minOccurs="0" />
                                        </xs:sequence>
                                    </xs:complexType>
                                </xs:element>
                                <xs:element name="Table2">
                                    <xs:complexType>
                                        <xs:sequence>
                                            <xs:element name="ORDER_NO" type="xs:string" minOccurs="0" />
                                            <xs:element name="PART_NO" type="xs:string" minOccurs="0" />
                                            <xs:element name="LINE_NO" type="xs:string" minOccurs="0" />
                                            <xs:element name="STATUS" type="xs:string" minOccurs="0" />
                                            <xs:element name="BO_FLAG" type="xs:string" minOccurs="0" />
                                            <xs:element name="QTY" type="xs:string" minOccurs="0" />
                                            <xs:element name="PRICE" type="xs:string" minOccurs="0" />
                                            <xs:element name="LINE_TOTAL" type="xs:string" minOccurs="0" />
                                            <xs:element name="ALL_QTY" type="xs:string" minOccurs="0" />
                                            <xs:element name="DLV_QTY" type="xs:string" minOccurs="0" />
                                            <xs:element name="OO_QTY" type="xs:string" minOccurs="0" />
                                            <xs:element name="STOCK_QTY" type="xs:string" minOccurs="0" />
                                            <xs:element name="CANCEL_QTY" type="xs:string" minOccurs="0" />
                                            <xs:element name="FNO" type="xs:string" minOccurs="0" />
                                            <xs:element name="REASON" type="xs:string" minOccurs="0" />
                                            <xs:element name="ACTFLG" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDUSR" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDWKS" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDPGM" type="xs:string" minOccurs="0" />
                                            <xs:element name="CTDDTM" type="xs:string" minOccurs="0" />
                                            <xs:element name="MDFUSR" type="xs:string" minOccurs="0" />
                                            <xs:element name="MDFWKS" type="xs:string" minOccurs="0" />
                                            <xs:element name="MDFPGM" type="xs:string" minOccurs="0" />
                                            <xs:element name="LSTMDF" type="xs:string" minOccurs="0" />
                                        </xs:sequence>
                                    </xs:complexType>
                                </xs:element>
                            </xs:choice>
                        </xs:complexType>
                    </xs:element>
                </xs:schema>
                <NewDataSet>
                    <Table1>
                        <ORDER_NO>22004S00906</ORDER_NO>
                        <STATUS>05</STATUS>
                        <ORDER_DAT>20180509</ORDER_DAT>
                        <ORDER_TIM>122315</ORDER_TIM>
                        <ORDER_OPTR>HUELOC1</ORDER_OPTR>
                        <EXP_RCV_DAT>00000000</EXP_RCV_DAT>
                        <WH_CODE>KPT</WH_CODE>
                        <TYPE_CODE>22</TYPE_CODE>
                        <BP_CODE>HVN</BP_CODE>
                        <TOTAL>720801.00</TOTAL>
                        <APV_DAT>20180509</APV_DAT>
                        <APV_TIM>122327</APV_TIM>
                        <APV_OPTR>HUELOC1</APV_OPTR>
                        <DCS_DAT>00000000</DCS_DAT>
                        <DCS_TIM> Test </DCS_TIM>
                        <DCS_OPTR> Test </DCS_OPTR>
                        <RMRK1>TEST</RMRK1>
                        <RMRK2> Test </RMRK2>
                        <REASON> Test </REASON>
                        <ACTFLG>A</ACTFLG>
                        <CTDUSR>HUELOC1</CTDUSR>
                        <CTDWKS>HVNL1069</CTDWKS>
                        <CTDPGM>frmDMSC01_1</CTDPGM>
                        <CTDDTM>2018-05-09T12:23:15.657+07:00</CTDDTM>
                        <MDFUSR>HUELOC1</MDFUSR>
                        <MDFWKS>HVNL1069</MDFWKS>
                        <MDFPGM>frmDMSC01_3</MDFPGM>
                        <LSTMDF>2018-05-09T12:23:27.91+07:00</LSTMDF>
                    </Table1>
                    <Table2>
                        <ORDER_NO>22004S00906</ORDER_NO>
                        <PART_NO>16400K03N31</PART_NO>
                        <LINE_NO>10</LINE_NO>
                        <STATUS>05</STATUS>
                        <BO_FLAG>Y</BO_FLAG>
                        <QTY>1</QTY>
                        <PRICE>386427.00</PRICE>
                        <LINE_TOTAL>386427.00</LINE_TOTAL>
                        <ALL_QTY>0</ALL_QTY>
                        <DLV_QTY>0</DLV_QTY>
                        <OO_QTY>1</OO_QTY>
                        <STOCK_QTY>0</STOCK_QTY>
                        <CANCEL_QTY>0</CANCEL_QTY>
                        <FNO> Test </FNO>
                        <REASON> Test </REASON>
                        <ACTFLG>A</ACTFLG>
                        <CTDUSR>HUELOC1</CTDUSR>
                        <CTDWKS>HVNL1069</CTDWKS>
                        <CTDPGM>frmDMSC01_1</CTDPGM>
                        <CTDDTM>2018-05-09T12:23:15.703+07:00</CTDDTM>
                        <MDFUSR>HUELOC1</MDFUSR>
                        <MDFWKS>HVNL1069</MDFWKS>
                        <MDFPGM>frmDMSC01_3</MDFPGM>
                        <LSTMDF>2018-05-09T12:23:27.91+07:00</LSTMDF>
                    </Table2>
                </NewDataSet>
            </ds>
            <strUSR>HUELOC1</strUSR>
            <strWKS>HVNL1069</strWKS>
            <strPGM>frmDMSC01</strPGM>
            <strUsername>22004</strUsername>
            <strPassword>Honda@2018</strPassword>
            <strDEALER_CODE>22004</strDEALER_CODE>
            <strErr></strErr>
            <showScreen>False</showScreen>
        </GUI_DON_HANG>
    </soapenv:Body>
</soapenv:Envelope>